src/cf/Documents/уатПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаявкаНаРасходованиеДС</xr:Item>
				<xr:Item>Document.уатПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.уатРемонтныйЛист</xr:Item>
				<xr:Item>Document.уатОтчетСистемыПлатон</xr:Item>
				<xr:Item>Document.уатШтраф</xr:Item>
				<xr:Item>Document.уатСчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.уатОтчетСистемыАвтодор</xr:Item>
				<xr:Item>Document.уатАвансовыйОтчет</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатДвижениеДС</xr:Item>
				<xr:Item>AccumulationRegister.уатЗаявкиНаРасходованиеДС</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиДСУПодотчетныхЛиц</xr:Item>
				<xr:Item>AccumulationRegister.уатОстаткиДС</xr:Item>
				<xr:Item>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.уатРасчетыПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Comment>Банковский счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>(Общ) электронно, почтой, телеграфом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>Дата входящего документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатШтраф</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаявкаНаРасходованиеДС</v8:Type>
						<v8:Type>cfg:DocumentRef.уатАвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.уатОтчетСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Comment>Оплачено</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Основание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Comment>Принято от</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Comment>Расчетный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Comment>(Общ) Банковский счет контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗаказов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>Договор контрагента</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатРемонтныйЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>Кратность взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>Курс взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Comment>Статья движения денежных средств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПланированияПлатежа</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаявкаНаРасходованиеДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаТС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Comment>Сумма платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Comment>Сумма взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/уатВидыОперацийПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыОперацийПлатежноеПоручениеИсходящее</Name>
			<Comment>Виды операций документа "Платежное поручение исходящее" (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатПлатежноеПоручениеИсходящее/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	МассивДоговоров = ЭтотОбъект.РасшифровкаПлатежа.ВыгрузитьКолонку("ДоговорКонтрагента");
	ТаблицаДоговоров = Новый таблицаЗначений;
	ТаблицаДоговоров.Колонки.Добавить("Договор");
	ТаблицаДоговоров.ЗагрузитьКолонку(МассивДоговоров,"Договор");
	ТаблицаДоговоров.Свернуть("Договор");
	
	Если ТаблицаДоговоров.Количество() = 1 Тогда
		ДоговорКонтрагента = ТаблицаДоговоров[0].Договор;
	Иначе
		ДоговорКонтрагента = Неопределено;
	КонецЕсли;
	
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,	"РазнесениеПлатежейПоЗаказам") Тогда
		СписокЗаказов = "";
		Для Каждого ТекСтрока Из Заказы Цикл
			ТекЗаказПредставление = ТекСтрока.ЗаказНаТС.Номер;
			Если СтрНайти(СписокЗаказов, ТекЗаказПредставление) = 0 Тогда
				СписокЗаказов = СписокЗаказов + ", " + ТекЗаказПредставление;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ПустаяСтрока(СписокЗаказов) Тогда
			СписокЗаказов = Сред(СписокЗаказов, 3);
		КонецЕсли;
	КонецЕсли;
	
	уатПроведение_проф.ПолучитьСтарыеЗаказыПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Оплачено Тогда
		// Инициализация дополнительных свойств для проведения документа.
		уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		Документы.уатПлатежноеПоручениеИсходящее.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей.
		уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		уатПроведение_проф.ОтразитьОстаткиДС(ДополнительныеСвойства, Движения, Отказ);
		уатПроведение_проф.ОтразитьЗаявкиНаРасходованиеДС(ДополнительныеСвойства, Движения, Отказ);
		уатПроведение_проф.ОтразитьДвижениеДДС(ДополнительныеСвойства, Движения, Отказ);
		
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику 
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю Тогда
			
			уатПроведение_проф.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
			уатПроведение_проф.ОтразитьРасчетыПоЗаказамНаТС(ДополнительныеСвойства, Движения, Отказ);
			
		ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику Тогда
			уатПроведение_проф.ОтразитьОстаткиДСУПодотчетныхЛиц(ДополнительныеСвойства, Движения, Отказ);
			
		КонецЕсли;
			
		уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		Документы.уатПлатежноеПоручениеИсходящее.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	КонецЕсли;

	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.уатПлатежноеПоручениеИсходящее.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
	Если НЕ Отказ Тогда
		уатПроведение_проф.ОбновитьПлатежныйКалендарьПриЗаписиДокумента(ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	ИначеЕсли ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.РасходДенежныхСредствПрочее
		Или ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПереводНаДругойСчет Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПодотчетноеЛицо"));
	Иначе
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПодотчетноеЛицо"));
	КонецЕсли;
	
	Если ВидОперации <> Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПереводНаДругойСчет Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СчетПолучателя"));
	КонецЕсли;
	
	Если НЕ РасшифровкаПлатежа.Итог("СуммаПлатежа")= СуммаДокумента Тогда
		ТекстНСТР = НСтр("en='Not the same amount of the document and its interpretation.';ru='Не совпадают сумма документа и ее расшифровка.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
	КонецЕсли;
	
	РазнесениеПоЗаказам = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам);
		
	Для Каждого Платеж Из РасшифровкаПлатежа Цикл
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами
			И (Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС) Тогда
			
			Если РасшифровкаПлатежа.Количество() = 1 Тогда
				ТекстНСТР = НСтр("en='The use of contract in the way of settling the ""accounts"" or ""invoice"" is not valid for the type of operation ""other settlements with counterparties""!';ru='Использование договора со способом взаиморасчетов ""По счетам"", ""По накладным"", ""По заказам на ТС"" недопустимо для вида операции ""Прочие расчеты с контрагентами""!'");
			Иначе
				ТекстНСТР = СтрШаблон(НСтр("en='At line No. %1 using contracts with settlement method ""By the bill"" or ""By the invoice"" is not valid for operation type ""Other settlements with counterparties""!';ru='В строке №%1 использование договора со способом взаиморасчетов ""По счетам"", ""По накладным"", ""По заказам на ТС"" недопустимо для вида операции ""Прочие расчеты с контрагентами""!'"), Платеж.НомерСтроки);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
		КонецЕсли;
		
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю Тогда
			
			// Сделка должна быть заполнена, если учет взаиморасчетов ведется по заказам.
			Если Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				Если НЕ ЗначениеЗаполнено(Платеж.Сделка) тогда
					Если РасшифровкаПлатежа.Количество() = 1 Тогда
						ТекстНСТР = НСтр("en='Not completed requisite value ""Invoice""';ru='Не заполнено значение реквизита ""Счет на оплату""'");
					Иначе
						ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 was not filled in attribute value ""Invoice""';ru='В строке №%1 не заполнено значение реквизита ""Счет на оплату""'"), Платеж.НомерСтроки);
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
				Если НЕ ЗначениеЗаполнено(Платеж.Сделка) тогда
					Если РасшифровкаПлатежа.Количество() = 1 Тогда
						ТекстНСТР = НСтр("en='Not completed requisite value ""Receipt""';ru='Не заполнено значение реквизита ""Поступление""'");
					Иначе
						ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 was not filled in attribute value ""Receipt""';ru='В строке №%1 не заполнено значение реквизита ""Поступление""'"), Платеж.НомерСтроки);
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				КонецЕсли;
				
			ИначеЕсли Платеж.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
				Если НЕ ЗначениеЗаполнено(Платеж.Сделка) тогда
					Если РасшифровкаПлатежа.Количество() = 1 Тогда
						ТекстНСТР = "Не заполнено значение реквизита ""Заказ на ТС""";
					Иначе
						ТекстНСТР = СтрШаблон("В строке №%1 не заполнено значение реквизита ""Заказ на ТС""", Платеж.НомерСтроки);
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Организация)	И Организация <> Платеж.ДоговорКонтрагента.Организация Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='Selected the contract of a counterparty, not corresponding to company specified in the document!';ru='Выбран договор контрагента, не соответствующий организации, указанной в документе!'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 selected counterparty contract that does not match to company specified in document!';ru='В строке №%1 выбран договор контрагента, не соответствующий организации, указанной в документе!'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами
			ИЛИ ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю Тогда
			
			Если Не ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='Counterparty contract not filled!';ru='Не заполнен договор контрагента!'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='At line №%1 is not fill counterparty contract!';ru='В строке №%1 не заполнен договор контрагента!'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Платеж.СуммаПлатежа) Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='Sum is not filled!';ru='Не заполнена сумма!'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='In line №%1 was not filled sum!';ru='В строке №%1 не заполнена сумма!'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Платеж.ДоговорКонтрагента) И Платеж.ДоговорКонтрагента.ВалютаВзаиморасчетов <> ВалютаДокумента Тогда
		//	ТекстНСТР = СтрШаблон(НСтр("en='In line №%1, the counterparty contract currency differs from document currency!';ru='В строке №%1 валюта договора контрагента отличается от валюты документа!'"), Платеж.НомерСтроки);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
		//КонецЕсли;
		
		Если РазнесениеПоЗаказам Тогда
			ИтогЗаказыСуммаПлатежа = 0;
			мсвСтрокЗаказы = Заказы.НайтиСтроки(Новый Структура("ID", Платеж.ID));
			Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
				ИтогЗаказыСуммаПлатежа = ИтогЗаказыСуммаПлатежа + ТекСтрокаЗаказ.СуммаПлатежа;
			КонецЦикла;
			
			Если ИтогЗаказыСуммаПлатежа > Платеж.СуммаПлатежа Тогда
				Если РасшифровкаПлатежа.Количество() = 1 Тогда
					ТекстНСТР = НСтр("en='The posted amount for the Vehicle Orders exceeds the payment amount.';" +
						"ru='Разнесенная сумма по Заказам на ТС превышает сумму платежа.'");
				Иначе
					ТекстНСТР = СтрШаблон(НСтр("en='The posted amount for the Vehicle Orders exceeds the payment amount at line No. %1.';" +
						"ru='Разнесенная сумма по Заказам на ТС превышает сумму платежа в строке №%1.'"), Платеж.НомерСтроки);
				КонецЕсли;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР,,,,Отказ);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	уатОбщегоНазначенияТиповые.ЗаполнитьШапкуДокумента(ЭтотОбъект, ПользователиКлиентСервер.АвторизованныйПользователь());
	
	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = уатОбщегоНазначенияТиповые.ВалютаРегламентированногоУчета(Организация);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаявкаНаРасходованиеДС") Тогда
		// Заполнение шапки
		ДокументОснование       = ДанныеЗаполнения;
		Основание               = ДанныеЗаполнения;
		Организация             = ДанныеЗаполнения.Организация;
		ВалютаДокумента         = ДанныеЗаполнения.ВалютаДокумента;
		ДатаВходящегоДокумента  = ДанныеЗаполнения.ДатаВходящегоДокумента;
		НомерВходящегоДокумента = ДанныеЗаполнения.НомерВходящегоДокумента;
		Приложение              = ДанныеЗаполнения.Приложение;
		ПринятоОт               = ДанныеЗаполнения.ПринятоОт;
		РасчетныйДокумент       = ДанныеЗаполнения.РасчетныйДокумент;
		Комментарий             = ДанныеЗаполнения.Комментарий;
		
		Если ДанныеЗаполнения.ВидОперации = Перечисления.уатВидыОперацийЗаявкиНаРасходование.ВыдачаПодотчетнику Тогда
			ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику;
			ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
		Иначе
			Контрагент = ДанныеЗаполнения.Контрагент;
			ДоговорКонтрагента    = ДанныеЗаполнения.ДоговорКонтрагента;
		КонецЕсли;
		
		Для Каждого ТекСтрокаРасшифровкаПлатежа Из ДанныеЗаполнения.РасшифровкаПлатежа Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			НоваяСтрока.Сделка                        = ТекСтрокаРасшифровкаПлатежа.Сделка;
			НоваяСтрока.ДоговорКонтрагента            = ТекСтрокаРасшифровкаПлатежа.ДоговорКонтрагента;
			НоваяСтрока.ВалютаВзаиморасчетов          = ВалютаДокумента;
						
			НоваяСтрока.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(Дата, НоваяСтрока.ДоговорКонтрагента, НоваяСтрока.Сделка);
			
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, НоваяСтрока.ДатаКурса, ЭтотОбъект);
			ВалютаВзаиморасчетовКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
				НоваяСтрока.ДатаКурса, ЭтотОбъект);
			НоваяСтрока.КурсВзаиморасчетов      = ВалютаВзаиморасчетовКурсКратность.Курс;
			НоваяСтрока.КратностьВзаиморасчетов = ВалютаВзаиморасчетовКурсКратность.Кратность;
			
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = ТекСтрокаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств;
			НоваяСтрока.СуммаПлатежа                  = ТекСтрокаРасшифровкаПлатежа.СуммаПлатежа;
			НоваяСтрока.СуммаВзаиморасчетов           = ТекСтрокаРасшифровкаПлатежа.СуммаПлатежа;
			НоваяСтрока.ДокументПланированияПлатежа   = ДанныеЗаполнения;
		КонецЦикла;
		
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатРемонтныйЛист") Тогда
		Если ДанныеЗаполнения.СпособРемонта = Перечисления.уатСпособыРемонта.Автосервис Тогда
			Организация = ДанныеЗаполнения.Организация;
			Подразделение = ДанныеЗаполнения.Подразделение;
			ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику;
			ДокументОснование	 = ДанныеЗаполнения;
			Основание			 = ДанныеЗаполнения;
			Контрагент			 = ДанныеЗаполнения.Контрагент;
			ДоговорКонтрагента	 = ДанныеЗаполнения.ДоговорКонтрагента;
			ВалютаДокумента		 = ДанныеЗаполнения.ВалютаДокумента;
			
			СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ДанныеЗаполнения, "Работы")
				+ уатОбщегоНазначенияТиповые.уатПолучитьСуммуДокументаСНДС(ДанныеЗаполнения, "Материалы");
			
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			Если ЗначениеЗаполнено(ДанныеЗаполнения.Сделка) Тогда
				НоваяСтрока.Сделка = ДанныеЗаполнения.Сделка;
			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
				НоваяСтрока.Сделка = ДанныеЗаполнения;
			КонецЕсли;
			НоваяСтрока.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента;
			
			НоваяСтрока.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(Дата, НоваяСтрока.ДоговорКонтрагента, НоваяСтрока.Сделка);
			
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, НоваяСтрока.ДатаКурса, ЭтотОбъект);
			ВалютаВзаиморасчетовКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
				НоваяСтрока.ДатаКурса, ЭтотОбъект);
			НоваяСтрока.КурсВзаиморасчетов      = ВалютаВзаиморасчетовКурсКратность.Курс;
			НоваяСтрока.КратностьВзаиморасчетов = ВалютаВзаиморасчетовКурсКратность.Кратность;
			
			НоваяСтрока.СуммаПлатежа = СуммаВзаиморасчетов;
			НоваяСтрока.СуммаВзаиморасчетов = СуммаВзаиморасчетов;
			
			СуммаДокумента = СуммаВзаиморасчетов;
			Комментарий = ДанныеЗаполнения.Комментарий;			
		Иначе
			ДокументОснование = ДанныеЗаполнения;
			Основание       = ДанныеЗаполнения;
			Организация     = ДанныеЗаполнения.Организация;
			Подразделение   = ДанныеЗаполнения.Подразделение;
			ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
		Если ДанныеЗаполнения.ОплатаПодотчетнымЛицом Тогда
			ВидОперации     = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику;
			ПодотчетноеЛицо = ДанныеЗаполнения.ПодотчетноеЛицо;
		Иначе
			ВидОперации     = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику;
		КонецЕсли;
		ДокументОснование   = ДанныеЗаполнения;
		Основание           = ДанныеЗаполнения;
		Контрагент          = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента  = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента     = ДанныеЗаполнения.ВалютаДокумента;
		СчетКонтрагента     = Контрагент.ОсновнойБанковскийСчет;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
		
		уатОбщегоНазначения_проф.ЗаполнитьБанковскийСчетКассуПриВводеНаОсновании(ЭтотОбъект);
		
		флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	уатПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта,
		|	уатПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) КАК ЗаказНаТС,
		|	уатПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
		|	уатПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	уатПоступлениеТоваровУслугТовары.Сумма КАК СуммаВалютная,
		|	уатПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДСвалютная
		|ИЗ
		|	Документ.уатПоступлениеТоваровУслуг.Товары КАК уатПоступлениеТоваровУслугТовары
		|ГДЕ
		|	уатПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатПоступлениеТоваровУслугУслуги.Номенклатура,
		|	уатПоступлениеТоваровУслугУслуги.Валюта,
		|	уатПоступлениеТоваровУслугУслуги.СтавкаНДС,
		|	уатПоступлениеТоваровУслугУслуги.ЗаказНаТС,
		|	уатПоступлениеТоваровУслугУслуги.Сумма,
		|	уатПоступлениеТоваровУслугУслуги.СуммаНДС,
		|	уатПоступлениеТоваровУслугУслуги.СуммаВалютная,
		|	уатПоступлениеТоваровУслугУслуги.СуммаНДСвалютная
		|ИЗ
		|	Документ.уатПоступлениеТоваровУслуг.Услуги КАК уатПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	уатПоступлениеТоваровУслугУслуги.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		тблРасшифровкаПлатежа = РасшифровкаПлатежа.ВыгрузитьКолонки().Скопировать();
		тблРасшифровкаПлатежа.Колонки.Добавить("ЗаказНаТС");
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = тблРасшифровкаПлатежа.Добавить();
			НоваяСтрока.ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
			
			Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
				ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС Тогда
				НоваяСтрока.Сделка = ТекСтрока.ЗаказНаТС;
			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
				НоваяСтрока.Сделка = ДанныеЗаполнения;
			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				НоваяСтрока.Сделка = ДанныеЗаполнения.Сделка;
			КонецЕсли;
			
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			
			Если флМноговалютныйУчет Тогда
				Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
					НоваяСтрока.ВалютаВзаиморасчетов = ДанныеЗаполнения.ВалютаВзаиморасчетов;
				Иначе
					Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
						НоваяСтрока.ВалютаВзаиморасчетов = ДанныеЗаполнения.ДокументОснование.ВалютаВзаиморасчетов;
					Иначе
						НоваяСтрока.ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
					КонецЕсли;
				КонецЕсли;
			Иначе
				НоваяСтрока.ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
			КонецЕсли;
			
			НоваяСтрока.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(Дата, НоваяСтрока.ДоговорКонтрагента, НоваяСтрока.Сделка);
			
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, НоваяСтрока.ДатаКурса, ЭтотОбъект);
			ВалютаВзаиморасчетовКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
				НоваяСтрока.ДатаКурса, ЭтотОбъект);
			НоваяСтрока.КурсВзаиморасчетов      = ВалютаВзаиморасчетовКурсКратность.Курс;
			НоваяСтрока.КратностьВзаиморасчетов = ВалютаВзаиморасчетовКурсКратность.Кратность;
			
			СуммаСтроки    = ТекСтрока.Сумма;
			СуммаНДССтроки = ТекСтрока.СуммаНДС;
			СуммаВалютнаяСтроки    = ТекСтрока.СуммаВалютная;
			СуммаНДСВалютнаяСтроки = ТекСтрока.СуммаНДСВалютная;
			Если ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС Тогда
				СуммаСтроки = СуммаСтроки + СуммаНДССтроки;
				СуммаВалютнаяСтроки = СуммаВалютнаяСтроки + СуммаНДСВалютнаяСтроки;
			КонецЕсли;
			
			СуммаВзаиморасчетовДопСвойства = Новый Структура;
			СуммаВзаиморасчетовДопСвойства.Вставить("МноговалютныйУчет",       флМноговалютныйУчет);
			СуммаВзаиморасчетовДопСвойства.Вставить("ВалютаДокумента",         ВалютаДокумента);
			СуммаВзаиморасчетовДопСвойства.Вставить("КурсДокумента",           ВалютаДокументаКурсКратность.Курс);
			СуммаВзаиморасчетовДопСвойства.Вставить("КратностьДокумента",      ВалютаДокументаКурсКратность.Кратность);
			СуммаВзаиморасчетовДопСвойства.Вставить("ВалютаВзаиморасчетов",    НоваяСтрока.ВалютаВзаиморасчетов);
			СуммаВзаиморасчетовДопСвойства.Вставить("КурсВзаиморасчетов",      ВалютаВзаиморасчетовКурсКратность.Курс);
			СуммаВзаиморасчетовДопСвойства.Вставить("КратностьВзаиморасчетов", ВалютаВзаиморасчетовКурсКратность.Кратность);
			СуммаВзаиморасчетовДопСвойства.Вставить("КроссКурсВзаиморасчетов", ДанныеЗаполнения.КроссКурс);
			СуммаВзаиморасчетовДопСвойства.Вставить("ДопПараметрыКурсаВалюты", ЭтотОбъект);
			НоваяСтрока.СуммаВзаиморасчетов = уатОбщегоНазначения_проф.СуммаВзаиморасчетовСтроки(
				СуммаСтроки, СуммаВалютнаяСтроки, ТекСтрока.Валюта, СуммаВзаиморасчетовДопСвойства);
			
			НоваяСтрока.СуммаПлатежа = СуммаСтроки;
			НоваяСтрока.СуммаНДС     = СуммаНДССтроки;
			НоваяСтрока.ЗаказНаТС    = ТекСтрока.ЗаказНаТС;
		КонецЦикла;
		
		тблРасшифровкаПлатежа.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СтатьяДвиженияДенежныхСредств, ЗаказНаТС",
			"СуммаПлатежа, СуммаНДС, СуммаВзаиморасчетов");
		тблРасшифровкаПлатежаСвернутая = тблРасшифровкаПлатежа.Скопировать();
		тблРасшифровкаПлатежаСвернутая.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СтатьяДвиженияДенежныхСредств",
			"СуммаПлатежа, СуммаНДС, СуммаВзаиморасчетов");
		
		РасшифровкаПлатежа.Загрузить(тблРасшифровкаПлатежаСвернутая);
		
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		// заполнение ТЧ Заказы
		Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам) Тогда
			
			Для Каждого ТекСтрока Из РасшифровкаПлатежа Цикл
				Если ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
					И ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаID = Неопределено;
				
				СтруктураПоиска = Новый Структура("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтатьяДвиженияДенежныхСредств");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
				мсвСтрокЗаказы = тблРасшифровкаПлатежа.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
					Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказ.ЗаказНаТС) Тогда
						Продолжить;
					КонецЕсли;
					Если ТекСтрокаID = Неопределено Тогда
						ТекСтрокаID = Новый УникальныйИдентификатор;
					КонецЕсли;
					
					НоваяСтрокаЗаказ                     = Заказы.Добавить();
					НоваяСтрокаЗаказ.ID                  = ТекСтрокаID;
					НоваяСтрокаЗаказ.ЗаказНаТС           = ТекСтрокаЗаказ.ЗаказНаТС;
					НоваяСтрокаЗаказ.СуммаВзаиморасчетов = ТекСтрокаЗаказ.СуммаВзаиморасчетов;
					НоваяСтрокаЗаказ.СуммаПлатежа        = ТекСтрокаЗаказ.СуммаПлатежа;
				КонецЦикла;
				
				Если ТекСтрокаID <> Неопределено Тогда
					ТекСтрока.ID = ТекСтрокаID;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатСчетНаОплатуПоставщика") Тогда
		ВидОперации         = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику;
		ДокументОснование   = ДанныеЗаполнения;
		Основание           = ДанныеЗаполнения;
		Контрагент          = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента  = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента     = ДанныеЗаполнения.ВалютаДокумента;
		СчетКонтрагента     = Контрагент.ОсновнойБанковскийСчет;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
		
		уатОбщегоНазначения_проф.ЗаполнитьБанковскийСчетКассуПриВводеНаОсновании(ЭтотОбъект, ДанныеЗаполнения);
				
		флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатСчетНаОплатуПоставщикаТовары.Номенклатура КАК Номенклатура,
		|	уатСчетНаОплатуПоставщикаТовары.Ссылка.ВалютаДокумента КАК Валюта,
		|	уатСчетНаОплатуПоставщикаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка) КАК ЗаказНаТС,
		|	уатСчетНаОплатуПоставщикаТовары.Сумма КАК Сумма,
		|	уатСчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДС,
		|	уатСчетНаОплатуПоставщикаТовары.Сумма КАК СуммаВалютная,
		|	уатСчетНаОплатуПоставщикаТовары.СуммаНДС КАК СуммаНДСвалютная
		|ИЗ
		|	Документ.уатСчетНаОплатуПоставщика.Товары КАК уатСчетНаОплатуПоставщикаТовары
		|ГДЕ
		|	уатСчетНаОплатуПоставщикаТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатСчетНаОплатуПоставщикаУслуги.Номенклатура,
		|	уатСчетНаОплатуПоставщикаУслуги.Валюта,
		|	уатСчетНаОплатуПоставщикаУслуги.СтавкаНДС,
		|	уатСчетНаОплатуПоставщикаУслуги.ЗаказНаТС,
		|	уатСчетНаОплатуПоставщикаУслуги.Сумма,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаНДС,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаВалютная,
		|	уатСчетНаОплатуПоставщикаУслуги.СуммаНДСвалютная
		|ИЗ
		|	Документ.уатСчетНаОплатуПоставщика.Услуги КАК уатСчетНаОплатуПоставщикаУслуги
		|ГДЕ
		|	уатСчетНаОплатуПоставщикаУслуги.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		тблРасшифровкаПлатежа = РасшифровкаПлатежа.ВыгрузитьКолонки().Скопировать();
		тблРасшифровкаПлатежа.Колонки.Добавить("ЗаказНаТС");
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = тблРасшифровкаПлатежа.Добавить();
			НоваяСтрока.ДоговорКонтрагента      = ДанныеЗаполнения.ДоговорКонтрагента;
			
			Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС
				ИЛИ ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС Тогда
				НоваяСтрока.Сделка = ТекСтрока.ЗаказНаТС;
			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
				НоваяСтрока.Сделка = ДанныеЗаполнения;
			ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным Тогда
				мсвНакладные = уатОбщегоНазначения_проф.НакладныеДляСчетаНаОплату(ДанныеЗаполнения);
				Если мсвНакладные.Количество() = 1 Тогда
					НоваяСтрока.Сделка = мсвНакладные[0];
				КонецЕсли;
			КонецЕсли;
			
			НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС;
			
			Если флМноговалютныйУчет
				И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.уатПоступлениеТоваровУслуг") Тогда
				
				НоваяСтрока.ВалютаВзаиморасчетов = ДанныеЗаполнения.ДокументОснование.ВалютаВзаиморасчетов;
			Иначе
				НоваяСтрока.ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
			КонецЕсли;
			
			НоваяСтрока.ДатаКурса = уатОбщегоНазначенияТиповые.ПолучитьДатуКурсаРасшифровкиПлатежа(Дата, НоваяСтрока.ДоговорКонтрагента, НоваяСтрока.Сделка);
			
			ВалютаДокументаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ВалютаДокумента, НоваяСтрока.ДатаКурса, ЭтотОбъект);
			ВалютаВзаиморасчетовКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
				НоваяСтрока.ДатаКурса, ЭтотОбъект);
			НоваяСтрока.КурсВзаиморасчетов      = ВалютаВзаиморасчетовКурсКратность.Курс;
			НоваяСтрока.КратностьВзаиморасчетов = ВалютаВзаиморасчетовКурсКратность.Кратность;
			
			СуммаСтроки    = ТекСтрока.Сумма;
			СуммаНДССтроки = ТекСтрока.СуммаНДС;
			СуммаВалютнаяСтроки    = ТекСтрока.СуммаВалютная;
			СуммаНДСВалютнаяСтроки = ТекСтрока.СуммаНДСВалютная;
			Если ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС Тогда
				СуммаСтроки = СуммаСтроки + СуммаНДССтроки;
				СуммаВалютнаяСтроки = СуммаВалютнаяСтроки + СуммаНДСВалютнаяСтроки;
			КонецЕсли;
			
			СуммаВзаиморасчетовДопСвойства = Новый Структура;
			СуммаВзаиморасчетовДопСвойства.Вставить("МноговалютныйУчет",       флМноговалютныйУчет);
			СуммаВзаиморасчетовДопСвойства.Вставить("ВалютаДокумента",         ВалютаДокумента);
			СуммаВзаиморасчетовДопСвойства.Вставить("КурсДокумента",           ВалютаДокументаКурсКратность.Курс);
			СуммаВзаиморасчетовДопСвойства.Вставить("КратностьДокумента",      ВалютаДокументаКурсКратность.Кратность);
			СуммаВзаиморасчетовДопСвойства.Вставить("ВалютаВзаиморасчетов",    НоваяСтрока.ВалютаВзаиморасчетов);
			СуммаВзаиморасчетовДопСвойства.Вставить("КурсВзаиморасчетов",      ВалютаВзаиморасчетовКурсКратность.Курс);
			СуммаВзаиморасчетовДопСвойства.Вставить("КратностьВзаиморасчетов", ВалютаВзаиморасчетовКурсКратность.Кратность);
			СуммаВзаиморасчетовДопСвойства.Вставить("ДопПараметрыКурсаВалюты", ЭтотОбъект);
			НоваяСтрока.СуммаВзаиморасчетов = уатОбщегоНазначения_проф.СуммаВзаиморасчетовСтроки(
				СуммаСтроки, СуммаВалютнаяСтроки, ТекСтрока.Валюта, СуммаВзаиморасчетовДопСвойства);
			
			НоваяСтрока.СуммаПлатежа = СуммаСтроки;
			НоваяСтрока.СуммаНДС     = СуммаНДССтроки;
			НоваяСтрока.ЗаказНаТС    = ТекСтрока.ЗаказНаТС;
		КонецЦикла;
		
		тблРасшифровкаПлатежаСвернутая = тблРасшифровкаПлатежа.Скопировать();
		тблРасшифровкаПлатежаСвернутая.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, ДатаКурса, СтатьяДвиженияДенежныхСредств",
			"СуммаПлатежа, СуммаНДС, СуммаВзаиморасчетов");
		
		РасшифровкаПлатежа.Загрузить(тблРасшифровкаПлатежаСвернутая);
		
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		// заполнение ТЧ Заказы
		Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.РазнесениеПлатежейПоЗаказам) Тогда
			
			Для Каждого ТекСтрока Из РасшифровкаПлатежа Цикл
				Если ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
					И ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаID = Неопределено;
				
				СтруктураПоиска = Новый Структура("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтатьяДвиженияДенежныхСредств");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
				мсвСтрокЗаказы = тблРасшифровкаПлатежа.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ТекСтрокаЗаказ Из мсвСтрокЗаказы Цикл
					Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказ.ЗаказНаТС) Тогда
						Продолжить;
					КонецЕсли;
					Если ТекСтрокаID = Неопределено Тогда
						ТекСтрокаID = Новый УникальныйИдентификатор;
					КонецЕсли;
					
					НоваяСтрокаЗаказ                     = Заказы.Добавить();
					НоваяСтрокаЗаказ.ID                  = ТекСтрокаID;
					НоваяСтрокаЗаказ.ЗаказНаТС           = ТекСтрокаЗаказ.ЗаказНаТС;
					НоваяСтрокаЗаказ.СуммаВзаиморасчетов = ТекСтрокаЗаказ.СуммаВзаиморасчетов;
					НоваяСтрокаЗаказ.СуммаПлатежа        = ТекСтрокаЗаказ.СуммаПлатежа;
				КонецЦикла;
				
				Если ТекСтрокаID <> Неопределено Тогда
					ТекСтрока.ID = ТекСтрокаID;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатАвансовыйОтчет") Тогда
		ВидОперации         = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВыдачаПодотчетнику;
		Основание           = ДанныеЗаполнения;
		ДокументОснование   = ДанныеЗаполнения;
		ПодотчетноеЛицо     = ДанныеЗаполнения.ПодотчетноеЛицо;
		ВалютаДокумента     = ДанныеЗаполнения.ВалютаДокумента;
		КурсДокумента       = ДанныеЗаполнения.Курс;
		КратностьДокумента  = ДанныеЗаполнения.Кратность;
		Организация         = ДанныеЗаполнения.Организация;
		Комментарий         = ДанныеЗаполнения.Комментарий;
				
		флСуммаНеВключаетНДС = (ДанныеЗаполнения.УчитыватьНДС И НЕ ДанныеЗаполнения.СуммаВключаетНДС);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	уатАвансовыйОтчетМатериалы.Ссылка.ВалютаДокумента КАК Валюта,
		|	уатАвансовыйОтчетМатериалы.Сумма КАК Сумма,
		|	уатАвансовыйОтчетМатериалы.СуммаНДС КАК СуммаНДС,
		|	уатАвансовыйОтчетМатериалы.Сумма КАК СуммаВалютная,
		|	уатАвансовыйОтчетМатериалы.СуммаНДС КАК СуммаНДСвалютная,
		|	уатАвансовыйОтчетМатериалы.Ссылка.Курс КАК Курс,
		|	уатАвансовыйОтчетМатериалы.Ссылка.Кратность КАК Кратность
		|ИЗ
		|	Документ.уатАвансовыйОтчет.Материалы КАК уатАвансовыйОтчетМатериалы
		|ГДЕ
		|	уатАвансовыйОтчетМатериалы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатАвансовыйОтчетРасходы.Валюта,
		|	уатАвансовыйОтчетРасходы.Сумма,
		|	уатАвансовыйОтчетРасходы.СуммаНДС,
		|	уатАвансовыйОтчетРасходы.Сумма,
		|	уатАвансовыйОтчетРасходы.СуммаНДС,
		|	уатАвансовыйОтчетРасходы.Курс,
		|	уатАвансовыйОтчетРасходы.Кратность
		|ИЗ
		|	Документ.уатАвансовыйОтчет.Расходы КАК уатАвансовыйОтчетРасходы
		|ГДЕ
		|	уатАвансовыйОтчетРасходы.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		тблДанные = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из тблДанные Цикл
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			
			Если ТекСтрока.Валюта = ВалютаДокумента Тогда
				НоваяСтрока.СуммаПлатежа = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
			Иначе
				СуммаСтроки = ТекСтрока.Сумма + ?(флСуммаНеВключаетНДС, ТекСтрока.СуммаНДС, 0);
				НоваяСтрока.СуммаПлатежа = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаСтроки,
					ТекСтрока.Валюта,    ВалютаДокумента,
					ТекСтрока.Курс,      КурсДокумента,
					ТекСтрока.Кратность, КратностьДокумента,,
					ЭтотОбъект);
			КонецЕсли;
		КонецЦикла;
		
		РасшифровкаПлатежа.Свернуть("СтатьяДвиженияДенежныхСредств", "СуммаПлатежа");
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатОтчетСистемыПлатон") Тогда
		ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику;
		ДокументОснование	 = ДанныеЗаполнения;
		Основание			 = ДанныеЗаполнения;
		Контрагент			 = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента	 = ДанныеЗаполнения.ДоговорКонтрагента;
		Организация			 = ДанныеЗаполнения.Организация;
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ДоговорКонтрагента   = ДанныеЗаполнения.ДоговорКонтрагента;
		НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента;
		НоваяСтрока.ДатаКурса            = ТекущаяДата();
		
		ВалютаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
			НоваяСтрока.ДатаКурса, ЭтотОбъект);
		НоваяСтрока.КурсВзаиморасчетов      = ВалютаКурсКратность.Курс;
		НоваяСтрока.КратностьВзаиморасчетов = ВалютаКурсКратность.Кратность;
		
		НоваяСтрока.СуммаПлатежа = ДанныеЗаполнения.Расходы.Итог("СписаниеСРЗ");

		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		НазначениеПлатежа = Нстр("ru = 'Пополнение Расчетной записи _______________ в СВП в соответствии с Распоряжением Правительства РФ от 29.08.2014 №1662-р и Постановлением Правительства РФ от 14.06.2013 г. №504. НДС не облагается.'; en = 'Replenishment of the Settlement Record _______________ in the SVP in accordance with the Order of the Government of the Russian Federation dated 29.08.2014 No. 1662-r and the Resolution of the Government of the Russian Federation dated 14.06.2013 No. 504. Not subject to VAT.'");
		Комментарий = ДанныеЗаполнения.Комментарий;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатОтчетСистемыАвтодор") Тогда
		ВидОперации = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ОплатаПоставщику;
		ДокументОснование	 = ДанныеЗаполнения;
		Основание			 = ДанныеЗаполнения;
		Контрагент			 = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента	 = ДанныеЗаполнения.ДоговорКонтрагента;
		Организация			 = ДанныеЗаполнения.Организация;
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ДоговорКонтрагента   = ДанныеЗаполнения.ДоговорКонтрагента;
		НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента;
		НоваяСтрока.ДатаКурса            = ТекущаяДата();
		
		ВалютаКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
			НоваяСтрока.ДатаКурса, ЭтотОбъект);
		НоваяСтрока.КурсВзаиморасчетов      = ВалютаКурсКратность.Курс;
		НоваяСтрока.КратностьВзаиморасчетов = ВалютаКурсКратность.Кратность;
		
		НоваяСтрока.СуммаПлатежа = ДанныеЗаполнения.Расходы.Итог("Сумма");

		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		Комментарий = ДанныеЗаполнения.Комментарий;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатШтраф") Тогда
		ВидОперации          = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ПрочиеРасчетыСКонтрагентами;
		ДокументОснование    = ДанныеЗаполнения;
		Основание            = ДанныеЗаполнения;
		Организация          = ДанныеЗаполнения.Организация;
		Контрагент           = ДанныеЗаполнения.ПолучательПлатежа;
		ДоговорКонтрагента   = ДанныеЗаполнения.ДоговорПолучателя;
		СчетКонтрагента      = ДанныеЗаполнения.СчетПолучателя;
		ИдентификаторПлатежа = ДанныеЗаполнения.НомерПостановления;
		Комментарий          = СтрШаблон(Нстр("ru = 'Оплата по документу ""%1""'; en = 'Payment under document ""%1""'"), ДанныеЗаполнения);
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.ДоговорКонтрагента   = ДанныеЗаполнения.ДоговорПолучателя;
		НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента;
		НоваяСтрока.ДатаКурса            = ТекущаяДата();
		НоваяСтрока.СуммаВзаиморасчетов  = ДанныеЗаполнения.СуммаОплаты;
		НоваяСтрока.СуммаПлатежа         = ДанныеЗаполнения.СуммаОплаты;
		СуммаДокумента                   = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
		НазначениеПлатежа = СтрШаблон(Нстр("ru = 'Штраф по административному правонарушению постановление №%1.'; en = 'Fine for administrative offence, Resolution No.%1.'"), ДанныеЗаполнения.НомерПостановления);
		
	ИначеЕсли уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.такАрендаТС") Тогда
		
		ВидОперации        = Перечисления.уатВидыОперацийПлатежноеПоручениеИсходящее.ВозвратПокупателю;
		
		ДокументОснование  = ДанныеЗаполнения;
		Основание          = ДанныеЗаполнения;
		Контрагент         = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
		ВалютаДокумента    = ДанныеЗаполнения.ВалютаДокумента;
		Организация        = ДанныеЗаполнения.Организация;
		
		уатОбщегоНазначения_проф.ЗаполнитьБанковскийСчетКассуПриВводеНаОсновании(ЭтотОбъект);
		
		флМноговалютныйУчет = ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет");
		
		СуммаДолга = уатОбщегоНазначенияТиповые_проф.ТекущийДолг(ДанныеЗаполнения.ДоговорКонтрагента, Неопределено, ДанныеЗаполнения);

		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ДепозитПоАрендеТС;
		Если ДанныеЗаполнения.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДокументуАрендаТС Тогда
			НоваяСтрока.Сделка = ДанныеЗаполнения;
		КонецЕсли;
		НоваяСтрока.ДоговорКонтрагента            = ДанныеЗаполнения.ДоговорКонтрагента;
		НоваяСтрока.ВалютаВзаиморасчетов = ДоговорКонтрагента.ВалютаВзаиморасчетов;
		
		НоваяСтрока.ДатаКурса = ТекущаяДата();
		ВалютаВзаиморасчетовКурсКратность = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(НоваяСтрока.ВалютаВзаиморасчетов,
			НоваяСтрока.ДатаКурса, ЭтотОбъект);
		НоваяСтрока.КурсВзаиморасчетов      = ВалютаВзаиморасчетовКурсКратность.Курс;
		НоваяСтрока.КратностьВзаиморасчетов = ВалютаВзаиморасчетовКурсКратность.Кратность;
		
		НоваяСтрока.СтавкаНДС               = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");

		СуммаСтроки    = - СуммаДолга;
		
		Если НоваяСтрока.ВалютаВзаиморасчетов = ВалютаДокумента Тогда
			НоваяСтрока.СуммаВзаиморасчетов = СуммаСтроки;
		Иначе
			НоваяСтрока.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаСтроки,
			ВалютаДокумента,                          НоваяСтрока.ВалютаВзаиморасчетов,
			ДанныеЗаполнения.КурсВзаиморасчетов,      ВалютаВзаиморасчетовКурсКратность.Курс,
			ДанныеЗаполнения.КратностьВзаиморасчетов, ВалютаВзаиморасчетовКурсКратность.Кратность,,
			ЭтотОбъект);
		КонецЕсли;
		
		НоваяСтрока.СуммаПлатежа = СуммаСтроки;
		
		РасшифровкаПлатежа.Свернуть("ДоговорКонтрагента, Сделка, СтавкаНДС, ВалютаВзаиморасчетов, КурсВзаиморасчетов, КратностьВзаиморасчетов, СтатьяДвиженияДенежныхСредств",
		"СуммаПлатежа, СуммаНДС, СуммаВзаиморасчетов");
		
		СуммаДокумента = РасшифровкаПлатежа.Итог("СуммаПлатежа");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = Неопределено; 
	Основание         = Неопределено;
КонецПроцедуры

#КонецОбласти
